configuration/src/InformationRegisters/DataAreaExchangeTransportSettings/DataAreaExchangeTransportSettings.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>DataAreaExchangeTransportSettings</name>
  <comment>Stores private exchange message transport settings for each data area.</comment>
  <resources>
    <name>CorrespondentEndpoint</name>
    <type>
      <types>DefinedType.MessagesQueueEndpoint</types>
    </type>
  </resources>
  <resources>
    <name>DataExchangeDirectory</name>
    <comment>Relative path to the exchange directory on the server or on the local network.</comment>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Peer</name>
    <type>
      <types>ExchangePlanRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/DataAreasExchangeTransportSettings/DataAreasExchangeTransportSettings.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>DataAreasExchangeTransportSettings</name>
  <comment>Stores settings for the transport of exchange messages that are common to all data areas.</comment>
  <resources>
    <name>FILEDataExchangeDirectory</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>FILECompressOutgoingMessageFile</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>FTPCompressOutgoingMessageFile</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>FTPConnectionMaxMessageSize</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>FTPConnectionPassiveConnection</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>FTPConnectionUser</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>FTPConnectionPort</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>FTPConnectionPath</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>DefaultExchangeMessagesTransportKind</name>
    <type>
      <types>EnumRef.ExchangeMessagesTransportTypes</types>
    </type>
  </resources>
  <resources>
    <name>DeleteFTPConnectionPassword</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>DeleteExchangeMessageArchivePassword</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>CorrespondentEndpoint</name>
    <type>
      <types>DefinedType.MessagesQueueEndpoint</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/Enums/ExchangeMessagesTransportTypes/ExchangeMessagesTransportTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ExchangeMessagesTransportTypes</name>
  <enumValues>
    <name>EMAIL</name>
  </enumValues>
  <enumValues>
    <name>FILE</name>
  </enumValues>
  <enumValues>
    <name>FTP</name>
  </enumValues>
  <enumValues>
    <name>WS</name>
  </enumValues>
  <enumValues>
    <name>COM</name>
  </enumValues>
  <enumValues>
    <name>WSPassiveMode</name>
  </enumValues>
  <enumValues>
    <name>ExternalSystem</name>
  </enumValues>
</mdclass:Enum>

configuration/src/InformationRegisters/DataAreaExchangeTransportSettings/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Private

Function TransportSettings(Val Peer) Export
	
	If Not Common.SubsystemExists("CloudTechnology") Then
		Raise NStr("en = 'The manager of exchange message transport settings is not defined.';");
	EndIf;
	
	MessagesExchangeTransportSettingsRegisterName = "MessageExchangeTransportSettings";
	
	QueryText =
	"SELECT
	|	"""" AS FILEDataExchangeDirectory,
	|	"""" AS FTPConnectionPath,
	|	DataAreaTransportSettings.DataExchangeDirectory AS RelativeInformationExchangeDirectory,
	|	DataAreasTransportSettings.FILEDataExchangeDirectory AS FILECommonInformationExchangeDirectory,
	|	DataAreasTransportSettings.FILECompressOutgoingMessageFile,
	|	DataAreasTransportSettings.FTPConnectionPath AS FTPCommonInformationExchangeDirectory,
	|	DataAreasTransportSettings.FTPCompressOutgoingMessageFile,
	|	DataAreasTransportSettings.FTPConnectionMaxMessageSize,
	|	DataAreasTransportSettings.FTPConnectionPassiveConnection,
	|	DataAreasTransportSettings.FTPConnectionUser,
	|	DataAreasTransportSettings.FTPConnectionPort,
	|	DataAreasTransportSettings.DefaultExchangeMessagesTransportKind,
	|	DataAreasTransportSettings.CorrespondentEndpoint,
	|	TransportSettings.WebServiceAddress AS WSWebServiceURL,
	|	TransportSettings.UserName AS WSUserName,
	|	"""" AS WSCorrespondentDataArea,
	|	"""" AS WSCorrespondentEndpoint
	|FROM
	|	InformationRegister.DataAreaExchangeTransportSettings AS DataAreaTransportSettings
	|		LEFT JOIN InformationRegister.DataAreasExchangeTransportSettings AS DataAreasTransportSettings
	|		ON (DataAreasTransportSettings.CorrespondentEndpoint = DataAreaTransportSettings.CorrespondentEndpoint)
	|		LEFT JOIN #TransportSettingsTable AS TransportSettings
	|		ON (TransportSettings.Endpoint = DataAreaTransportSettings.CorrespondentEndpoint)
	|WHERE
	|	DataAreaTransportSettings.Peer = &Peer";
	QueryText = StrReplace(QueryText, "#TransportSettingsTable", "InformationRegister." + MessagesExchangeTransportSettingsRegisterName);
	
	Query = New Query(QueryText);
	Query.SetParameter("Peer", Peer);
	
	SetPrivilegedMode(True);
	QueryResult = Query.Execute();
	SetPrivilegedMode(False);
	
	If QueryResult.IsEmpty() Then
		Return Undefined;
	EndIf;
	
	Result = DataExchangeInternal.QueryResultToStructure(QueryResult);
	
	SetPrivilegedMode(True);
	Passwords = Common.ReadDataFromSecureStorage(Result.CorrespondentEndpoint,
		"FTPConnectionDataAreasPassword,WSPassword, ArchivePasswordDataAreaExchangeMessages", True);
	SetPrivilegedMode(False);
	
	Result.Insert("WSPassword", Passwords.WSPassword);
	Result.Insert("FTPConnectionPassword", Passwords.FTPConnectionDataAreasPassword);
	Result.Insert("ArchivePasswordExchangeMessages", Passwords.ArchivePasswordDataAreaExchangeMessages);
	
	Result.FILEDataExchangeDirectory = CommonClientServer.GetFullFileName(
		Result.FILECommonInformationExchangeDirectory,
		Result.RelativeInformationExchangeDirectory);
	
	Result.FTPConnectionPath = CommonClientServer.GetFullFileName(
		Result.FTPCommonInformationExchangeDirectory,
		Result.RelativeInformationExchangeDirectory);
	
	Result.Insert("UseTempDirectoryToSendAndReceiveMessages", True);
	
	If Result.DefaultExchangeMessagesTransportKind = Enums.ExchangeMessagesTransportTypes.FTP Then
		
		FTPParameters = DataExchangeServer.FTPServerNameAndPath(Result.FTPConnectionPath);
		
		Result.Insert("FTPServer", FTPParameters.Server);
		Result.Insert("FTPPath",   FTPParameters.Path);
		
	Else
		Result.Insert("FTPServer", "");
		Result.Insert("FTPPath",   "");
	EndIf;
	
	DataExchangeInternal.AddTransactionItemsCountToTransportSettings(Result);
	
	Return Result;
EndFunction

Function TransportSettingsWS(Val Peer) Export
	
	If Not Common.SubsystemExists("CloudTechnology") Then
		Raise NStr("en = 'The manager of exchange message transport settings is not defined.';");
	EndIf;
	
	MessagesExchangeTransportSettingsRegisterName = "MessageExchangeTransportSettings";
	
	Query = New Query(
	"SELECT
	|	DataAreaTransportSettings.CorrespondentEndpoint AS CorrespondentEndpoint
	|FROM
	|	InformationRegister.DataAreaExchangeTransportSettings AS DataAreaTransportSettings
	|WHERE
	|	DataAreaTransportSettings.Peer = &Peer");
	Query.SetParameter("Peer", Peer);
	
	Selection = Query.Execute().Select();
	Selection.Next();
	
	Endpoint = Selection.CorrespondentEndpoint;
	
	TransportSettingManager = Common.ObjectManagerByFullName("InformationRegister."
		+ MessagesExchangeTransportSettingsRegisterName);
	SettingsStructure = TransportSettingManager.TransportSettingsWS(Endpoint);
	
	If Not ValueIsFilled(SettingsStructure.WSWebServiceURL) Then
		Raise StringFunctionsClientServer.SubstituteParametersToString(
			NStr("en = 'Peer infobase ""%1"" connection is not set up.';"),
			String(Peer));
	EndIf;
	
	Return SettingsStructure;
	
EndFunction

// Updates a register record by the passed structure values
//
Procedure UpdateRecord(RecordStructure) Export
	
	DataExchangeInternal.UpdateInformationRegisterRecord(RecordStructure, "DataAreaExchangeTransportSettings");
	
EndProcedure

#EndRegion

#EndIf
